HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xa/IfxEth_reg.h
/** \\brief  184C, MAC Address Low Register */
#define ETH_MAC_ADDRESS_G19_LOW /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_ADDRESS_LOW*)0xF001E84Cu)

/** Alias (User Manual Name) for ETH_MAC_ADDRESS_G19_LOW.
* To use register names with standard convension, please use ETH_MAC_ADDRESS_G19_LOW.
*/
#define	ETH_MAC_ADDRESS25_LOW	(ETH_MAC_ADDRESS_G19_LOW)

/** \\brief  1000, Register 0 - MAC Configuration Register */
#define ETH_MAC_CONFIGURATION /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_CONFIGURATION*)0xF001E000u)

/** \\brief  1004, Register 1 - MAC Frame Filter */
#define ETH_MAC_FRAME_FILTER /*lint --e(923)*/ (*(volatile Ifx_ETH_MAC_FRAME_FILTER*)0xF001E004u)

/** \\brief  2020, Register 8 - Missed Frame and Buffer Overflow Counter
 * Register */
#define ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER /*lint --e(923)*/ (*(volatile Ifx_ETH_MISSED_FRAME_AND_BUFFER_OVERFLOW_COUNTER*)0xF001F020u)

/** \\brief  1100, Register 64 - MMC Control Register */
#define ETH_MMC_CONTROL /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_CONTROL*)0xF001E100u)

/** \\brief  1208, Register 130 - MMC Receive Checksum Offload Interrupt
 * Register */
#define ETH_MMC_IPC_RECEIVE_INTERRUPT /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT*)0xF001E208u)

/** \\brief  1200, Register 128 - MMC Receive Checksum Offload Interrupt Mask
 * Register */
#define ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_IPC_RECEIVE_INTERRUPT_MASK*)0xF001E200u)

/** \\brief  1104, Register 65 - MMC Receive Interrupt Register */
#define ETH_MMC_RECEIVE_INTERRUPT /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_RECEIVE_INTERRUPT*)0xF001E104u)

/** \\brief  110C, - */
#define ETH_MMC_RECEIVE_INTERRUPT_MASK /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_RECEIVE_INTERRUPT_MASK*)0xF001E10Cu)

/** \\brief  1108, Register 66 - MMC Transmit Interrupt Register */
#define ETH_MMC_TRANSMIT_INTERRUPT /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_TRANSMIT_INTERRUPT*)0xF001E108u)

/** \\brief  1110, Register 68 - MMC Transmit Interrupt Mask Register */
#define ETH_MMC_TRANSMIT_INTERRUPT_MASK /*lint --e(923)*/ (*(volatile Ifx_ETH_MMC_TRANSMIT_INTERRUPT_MASK*)0xF001E110u)

/** \\brief  2018, Register 6 - Operation Mode Register */
#define ETH_OPERATION_MODE /*lint --e(923)*/ (*(volatile Ifx_ETH_OPERATION_MODE*)0xF001F018u)

/** \\brief  102C, Register 11 - PMT Control and Status Register */
#define ETH_PMT_CONTROL_STATUS /*lint --e(923)*/ (*(volatile Ifx_ETH_PMT_CONTROL_STATUS*)0xF001E02Cu)

/** \\brief  172C, Register 459 - PPS Control Register */
#define ETH_PPS_CONTROL /*lint --e(923)*/ (*(volatile Ifx_ETH_PPS_CONTROL*)0xF001E72Cu)

/** \\brief  200C, Register 3 - Receive Descriptor List Address Register */
#define ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_DESCRIPTOR_LIST_ADDRESS*)0xF001F00Cu)

/** \\brief  2024, Register 9 - Receive Interrupt Watchdog Timer Register */
#define ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_INTERRUPT_WATCHDOG_TIMER*)0xF001F024u)

/** \\brief  2008, Register 2 - Receive Poll Demand Register */
#define ETH_RECEIVE_POLL_DEMAND /*lint --e(923)*/ (*(volatile Ifx_ETH_RECEIVE_POLL_DEMAND*)0xF001F008u)

/** \\brief  1028, Register 10 - Remote Wake-Up Frame Filter Register */
#define ETH_REMOTE_WAKE_UP_FRAME_FILTER /*lint --e(923)*/ (*(volatile Ifx_ETH_REMOTE_WAKE_UP_FRAME_FILTER*)0xF001E028u)

/** \\brief  11C0, Register 112 - Receive Frame Count for Good and Bad 1,024 to
 * Maxsize Bytes Frames */
#define ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_1024TOMAXOCTETS_FRAMES_GOOD_BAD*)0xF001E1C0u)

/** \\brief  11B4, Register 109 - Receive Frame Count for Good and Bad 128 to
 * 255 Bytes Frames */
#define ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_128TO255OCTETS_FRAMES_GOOD_BAD*)0xF001E1B4u)

/** \\brief  11B8, Register 110 - Receive Frame Count for Good and Bad 256 to
 * 511 Bytes Frames */
#define ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_256TO511OCTETS_FRAMES_GOOD_BAD*)0xF001E1B8u)

/** \\brief  11BC, Register 111 - Receive Frame Count for Good and Bad 512 to
 * 1,023 Bytes Frames */
#define ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_512TO1023OCTETS_FRAMES_GOOD_BAD*)0xF001E1BCu)

/** \\brief  11AC, Register 107 - Receive Frame Count for Good and Bad 64 Byte
 * Frames */
#define ETH_RX_64OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_64OCTETS_FRAMES_GOOD_BAD*)0xF001E1ACu)

/** \\brief  11B0, Register 108 - Receive Frame Count for Good and Bad 65 to 127
 * Bytes Frames */
#define ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_65TO127OCTETS_FRAMES_GOOD_BAD*)0xF001E1B0u)

/** \\brief  1198, Register 102 - Receive Frame Count for Alignment Error Frames */
#define ETH_RX_ALIGNMENT_ERROR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_ALIGNMENT_ERROR_FRAMES*)0xF001E198u)

/** \\brief  118C, Register 99 - Receive Frame Count for Good Broadcast Frames */
#define ETH_RX_BROADCAST_FRAMES_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_BROADCAST_FRAMES_GOOD*)0xF001E18Cu)

/** \\brief  11E4, Register 121 - Receive Frame Count for Good Control Frames
 * Frames */
#define ETH_RX_CONTROL_FRAMES_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_CONTROL_FRAMES_GOOD*)0xF001E1E4u)

/** \\brief  1194, Register 101 - Receive Frame Count for CRC Error Frames */
#define ETH_RX_CRC_ERROR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_CRC_ERROR_FRAMES*)0xF001E194u)

/** \\brief  11D4, Register 117 - Receive Frame Count for FIFO Overflow Frames */
#define ETH_RX_FIFO_OVERFLOW_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_FIFO_OVERFLOW_FRAMES*)0xF001E1D4u)

/** \\brief  1180, Register 96 - Receive Frame Count for Good and Bad Frames */
#define ETH_RX_FRAMES_COUNT_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_FRAMES_COUNT_GOOD_BAD*)0xF001E180u)

/** \\brief  11A0, Register 104 - Receive Frame Count for Jabber Error Frames */
#define ETH_RX_JABBER_ERROR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_JABBER_ERROR_FRAMES*)0xF001E1A0u)

/** \\brief  11C8, Register 114 - Receive Frame Count for Length Error Frames */
#define ETH_RX_LENGTH_ERROR_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_LENGTH_ERROR_FRAMES*)0xF001E1C8u)

/** \\brief  1190, Register 100 - Receive Frame Count for Good Multicast Frames */
#define ETH_RX_MULTICAST_FRAMES_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_MULTICAST_FRAMES_GOOD*)0xF001E190u)

/** \\brief  1188, Register 98 - Receive Octet Count for Good Frames */
#define ETH_RX_OCTET_COUNT_GOOD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OCTET_COUNT_GOOD*)0xF001E188u)

/** \\brief  1184, Register 97 - Receive Octet Count for Good and Bad Frames */
#define ETH_RX_OCTET_COUNT_GOOD_BAD /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OCTET_COUNT_GOOD_BAD*)0xF001E184u)

/** \\brief  11CC, Register 115 - Receive Frame Count for Out of Range Frames */
#define ETH_RX_OUT_OF_RANGE_TYPE_FRAMES /*lint --e(923)*/ (*(volatile Ifx_ETH_RX_OUT_OF_RANGE_TYPE_FRAMES*)0xF001E1CCu)

